yul78/STM32H723ZGT6_ROV/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usart.h"
#include "dma.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define tank_rear_full_Pin GPIO_PIN_2
#define tank_rear_full_GPIO_Port GPIOE
#define tank_rear_full_EXTI_IRQn EXTI2_IRQn
#define tank_rear_empty_Pin GPIO_PIN_3
#define tank_rear_empty_GPIO_Port GPIOE
#define tank_rear_empty_EXTI_IRQn EXTI3_IRQn
#define OLED_SDA_Pin GPIO_PIN_0
#define OLED_SDA_GPIO_Port GPIOF
#define OLED_SCL_Pin GPIO_PIN_1
#define OLED_SCL_GPIO_Port GPIOF
#define EN2OUT_Pin GPIO_PIN_1
#define EN2OUT_GPIO_Port GPIOA
#define DIR2OUT_Pin GPIO_PIN_7
#define DIR2OUT_GPIO_Port GPIOA
#define DIR1OUT_Pin GPIO_PIN_4
#define DIR1OUT_GPIO_Port GPIOC
#define MPU_IIC_SCL_Pin GPIO_PIN_1
#define MPU_IIC_SCL_GPIO_Port GPIOB
#define MPU_IIC_SDA_Pin GPIO_PIN_2
#define MPU_IIC_SDA_GPIO_Port GPIOB
#define EN1OUT_Pin GPIO_PIN_10
#define EN1OUT_GPIO_Port GPIOC
#define tank_front_empty_Pin GPIO_PIN_5
#define tank_front_empty_GPIO_Port GPIOD
#define tank_front_empty_EXTI_IRQn EXTI9_5_IRQn
#define tank_front_full_Pin GPIO_PIN_6
#define tank_front_full_GPIO_Port GPIOD
#define tank_front_full_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
